Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: ནམ་མཁའ་ཇི་ལྟར་གཙེས་པ་མེད་ཅིང་གནོད་པ་མེད་པ་དེ་བཞིན་དུ་སེམས་དང་རྣམ་པར་རྟོག་པ་དང་རྣམ་པར་དཔྱོད་པས་གཙེས་པ་མེད་ཅིང་གནོད་པ་མེད་པའི་བཟོད་པའོ། །
en: This acceptance is without injury and lacks the torment caused by the mind, conceptual thought, and discrimination in the same way that space is without torment and without injury.

source: ནམ་མཁའ་ཇི་ལྟར་བག་ལ་ཉལ་བ་ཐམས་ཅད་དང་བྲལ་བ་དེ་བཞིན་དུ་ཚིག་གི་ལམ་ཐམས་ཅད་བག་ལ་ཉལ་བ་དང་བྲལ་བའི་བཟོད་པའོ། །
en: This acceptance is free from the latent tendencies of all linguistic expression just as space is free of all latent tendencies.

source: ནམ་མཁའ་ཇི་ལྟར་མ་སྐྱེས་མ་བྱུང་བ་དེ་བཞིན་དུ་མཚན་ཉིད་ཐམས་ཅད་སྔར་མ་སྐྱེས་མ་བྱུང་བའི་བཟོད་པ་བསྒྲུབས་པའོ། །
en: They have accomplished the acceptance that all characteristics have not arisen before and are unoriginated, just as space is unborn and unoriginated.

source: ནམ་མཁའ་ཇི་ལྟར་སྤྲོས་པ་མེད་པ་དེ་བཞིན་དུ་ཁམས་གསུམ་གྱི་བག་ལ་ཉལ་བ་ཐམས་ཅད་སྤྲོས་པ་མེད་པའི་བཟོད་པའོ། །
en: This acceptance lacks the elaboration of all latent tendencies of the three realms in the same way that space lacks elaborations.

source: ནམ་མཁའ་ཇི་ལྟར་ཁམས་གསུམ་པར་གཏོགས་པ་དེ་བཞིན་དུ་གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བ་ཁམས་གསུམ་པར་གཏོགས་པ་ཡང་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་།
en: The apparent characteristics of forms are included in the three realms in the same way that space is included in the three realms, but they have the characteristic of being impermanent, suffering, empty, and lacking a self.

source: བདག་མེད་པ་མཚན་ཉིད་དམིགས་པ་མེད་པའི་མཚན་ཉིད་དང་བྲལ་བའི་བཟོད་པ་སྒོམ་པར་བྱེད་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཉེ་བར་འཚོ་བའི་བཟོད་པར་བལྟ་བར་བྱའོ། །
en: The cultivation of the acceptance of nonapprehension that is free from characteristics should be regarded as the bodhisattvas’ acceptance that ripens and looks after beings.

source: ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོའི་ལེའུ་སྟེ་ལྔ་པའོ།། །།
en: This was the fifth chapter of the Great Vehicle sūtra entitled “The Acceptance That Tames Beings with the Sky-Colored Method of Perfect Conduct.”

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔས་ཚོར་བའི་ཕུང་པོ་ཡང་ཚུལ་བཞིན་དུ་བརྟག་པར་བྱའོ། །
en: Chapter 6 “Furthermore, noble son, bodhisattvas should correctly analyze the aggregate of feeling.

source: དེ་ལ་ཚོར་བའི་ཕུང་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What is the aggregate of feeling?

source: ཚོར་བའི་ཚོགས་རྣམ་པ་དྲུག་སྟེ། མིག་གི་འདུས་ཏེ་རེག་པ་ལས་སྐྱེས་པའི་ཚོར་བ་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་།
en: The groups of feelings are of six types: feelings that arise through eye contact, ear contact, nose contact, tongue contact, body contact, and mind contact.

source: ལུས་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་སྐྱེས་པའི་ཚོར་བ་སྟེ། འདི་དག་ནི་ཚོར་བའི་ཕུང་པོ་ཞེས་བྱའོ། །
en: These are known as the aggregate of feeling.

source: ཚོར་བའི་ཕུང་པོ་དེ་ལ་ཚོར་བ་རྣམ་པ་གསུམ་དུ་ཤེས་པར་འགྱུར་ཏེ།
en: The aggregate of feeling is understood in terms of three types of feelings.

source: གསུམ་གང་ཞེ་ན།
en: What are those three?

source: བདེ་བར་ཚོར་བ་དང་། སྡུག་བསྔལ་བར་ཚོར་བ་དང་། བདེ་བ་དང་། སྡུག་བསྔལ་དུའང་མི་ཤེས་པར་ཚོར་བ་སྟེ།
en: Pleasant feelings, unpleasant feelings, and feelings that are neither pleasant nor unpleasant.

source: འདི་དག་རྣམ་གསུམ་ནི་ཚོར་བའི་ཕུང་པོ་ཞེས་བྱའོ། །
en: Those three types of feelings are referred to as the aggregate of feeling.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་བརྒྱད་པོ་འདི་དག་གིས་ཚོར་བའི་ཕུང་པོ་ཚུལ་བཞིན་དུ་བརྟག་པར་བྱའོ། །
en: Noble son, bodhisattvas should correctly analyze the aggregate of feeling using these eight aspects.

source: དེ་ལ་བརྒྱད་གང་ཞེ་ན།
en: What are the eight aspects?

source: རིགས་ཀྱི་བུ་ཉོན་མོངས་པའི་རྩ་བ་གསུམ་སྟེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཅེས་བྱའོ། །
en: Noble son, there are three root afflictions—desire, anger, and delusion.

source: ཉོན་མོངས་པའི་རྩ་བ་གསུམ་པོ་འདི་དག་གིས་སེམས་ཅན་ཉོན་མོངས་པ་རྣམས་འདོད་ཆགས་དང་བྲལ་བ་ཟག་པ་ཟད་པ་དང་བཅས་པར་མི་འགྱུར་རོ། །
en: Afflicted beings are not free from desires and their defilements have not been extinguished.

source: ཉོན་མོངས་པའི་རྩ་བ་གསུམ་པོ་འདི་དག་ཚོར་བ་རྣམ་པ་གསུམ་ལ་ཞུགས་པ་དེ་ལ་ཉོན་མོངས་པ་རྣམ་པ་ཐ་དད་པར་འགྱུར་རོ། །
en: The three root afflictions enter into the three types of feelings and then different kinds of afflictions emerge.

source: དེ་ལ་ཚོར་བའི་ཚོགས་དྲུག་གིས་ཚོར་བ་རྣམ་གསུམ་ཚུལ་བཞིན་དུ་བརྟག་པར་བྱའོ། །
en: A bodhisattva should correctly analyze the three types of feelings using the six groups of feelings.

source: ཚོར་བ་རྣམ་གསུམ་གྱིས་ཉོན་མོངས་པའི་རྩ་བ་འབྱུང་བ་དང་། ལས་ཀྱི་རྩ་བ་དང་། ཟད་པའི་རྩ་བ་ནུབ་པ་ཚུལ་བཞིན་དུ་བརྟག་པར་བྱའོ། །
en: They should use the three types of feeling to correctly analyze the arising of the root afflictions, the root of karma, the root of their destruction, and their disappearance.

source: དེ་མིག་གིས་གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བ་དམའ་བ་འམ། བདེ་བ་འམ། ཆེ་བའམ། ཕྲ་བའམ། གང་ཉེ་བའམ། གང་རིང་བར་མཐོང་བ་དེ་ལ་ཚོར་བ་འབྱུང་ངོ་། །
en: “Feelings arise when the characteristics of form—whether inferior, blissful, big, small, near, or far—are perceived through the eyes.

source: གང་གཟུགས་བདེ་བའམ། ཆེ་བའམ། ཕྲ་བའམ། གང་རིང་བའམ། ཉེ་བར་མཐོང་བ་དེ་ལ་ཚོར་བ་སྲེད་པའི་གནས་ཆུའི་ཆུ་བུར་ལྟ་བུ་དང་།
en: When one perceives forms that are blissful, big, small, near, or far away, the feeling that is the basis for craving is like a water bubble.

source: མངོན་པར་དགའ་བ་འབྱུང་བར་འགྱུར་བ་དེ་ལ་ཡང་ཚུལ་བཞིན་དུ་བརྟག་པར་བྱའོ། །ཇི་ལྟར་ཡང་མིག་མིག་གིས་སྟོང་པ་ནས་ཇི་ལྟར་གོང་དུ་བཤད་པའི་བར་དུ་དེ་གློ་བུར་དང་། ལུས་མ་ཡིན་པ་དང་།
en: That is the way that one should correctly analyze feeling when pleasure arises.

source: གནས་མེད་པ་དང་། གཟུགས་མེད་པ་དང་། བསྟན་དུ་མེད་པ་དང་། དངོས་པོ་མེད་པ་དང་། ཡི་གེ་མེད་པ་ཚོར་བ་ཆུའི་ཆུ་བུར་ལྟ་བུར་འབྱུང་ངོ་། །
en: Just as before, when it was said that the eye is empty of the eye, those feelings that arise like water bubbles are fleeting, devoid of a body, groundless, without form, undefinable, insubstantial, and wordless.

source: འདོད་ཆགས་ཀྱིས་ཀུན་ཏུ་བསྒྲིབས་པ་འབྱུང་ངོ་། །སློང་བ་པོའམ།
en: Hindrances arise everywhere because of attachment.

source: དགོད་པ་པོའམ། ཀུན་ཏུ་རྒྱུ་བ་པོའམ། སོགས་པར་ཡང་མི་ཤེས་སོ། །
en: Bodhisattvas do not perceive feelings as causing arousal, establishment, movement, or accumulation.

source: འབྱུང་བའི་མཚན་ཉིད་བདག་པོ་མེད་པ་དང་། འགོག་པ་ལ་ཡང་བདག་པོ་མེད་པ་དང་། མཚན་ཉིད་ཚོར་བ་ལ་ཡང་བདག་པོ་མེད་པ་སྟེ། མཚན་ཉིད་མེད་པའི་ཆོས་འདི་དག་ཐམས་ཅད་ལ་ཡང་སྲོག་མེད་པ་དང་། སྲོག་དང་བྲལ་བ་དང་། སེམས་ཅན་མེད་པ་དང་། སེམས་ཅན་དང་བྲལ་བ་དང་། གསོ་བ་མེད་པ་དང་། གསོ་བ་དང་བྲལ་བ་དང་།
en: The characteristic of arising has no owner, its cessation has no owner, and thus characteristics and feelings have no owner.

source: གང་ཟག་མེད་པ་དང་། གང་ཟག་དང་བྲལ་བ་དང་། འདོད་པ་མེད་པ་དང་། དངོས་པོ་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་དང་།
en: All those phenomena that are without characteristics are without a life force and devoid of a life force, without being and devoid of being, without a soul and devoid of a soul, without a person and devoid of a person, and without desire, insubstantial, devoid of characteristics, and without an owner.

source: བདག་པོ་མེད་པ་དང་། མཚན་ཉིད་འཇིག་པ་དང་། ཟད་པའི་འདུ་བྱེད་ཀྱི་སྡུག་བསྔལ་དངོས་པོ་མེད་པ་དང་།
en: They have the characteristic of disintegrating, and the suffering associated with perishable formations is insubstantial.

source: དུས་གསུམ་གྱི་འདོད་ཆགས་དང་བྲལ་བའི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: Thus, they are empty in the sense that they are free from attachment related to the three times.

source: བརྗོད་དུ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is inexpressible.

source: གཉིས་སུ་མེད་པའི་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is nondual.

source: རྒྱུན་ཆད་པ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is unending.

source: རྟག་པ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is impermanent.

source: མཚན་མ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is without marks.

source: སྨོན་པ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is without purpose.

source: ཚོར་བ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment lacks feeling.

source: བྱེད་པ་པོའི་རྣམ་པ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment has no agent.

source: ཤེས་པ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment has no perceiver.

source: ལེན་པ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment has no receiver.

source: གྲོལ་བ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is without liberation.

source: དངོས་པོ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is insubstantial.

source: མུན་པ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is without darkness.

source: སྣང་བ་མེད་པ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are empty in the sense that attachment is devoid of light.

source: དུས་གསུམ་གྱི་འདོད་ཆགས་དམིགས་པ་རྣམ་པར་སོགས་སོ། །
en: “Bodhisattvas accumulate this apprehension of attachment related to the three times.

source: གནས་སམ། བྱེད་དུ་འཇུག་པའམ། སོགས་པར་བྱ་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: They do not perceive a basis, an agent, or accumulation.

source: སེམས་སྒྱུ་མ་ལྟ་བུ་དང་། དུས་གསུམ་གྱི་འདོད་ཆགས་དངོས་པོ་དང་དངོས་པོ་མེད་པ་ཡོངས་སུ་ཆད་པར་ཡང་རྣམ་པར་མི་རྟོག་གོ། །
en: They do not conceive of the illusory mind or the desires of the three times as existent or nonexistent or annihilated.

source: ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་ཅི་ལ་ཡང་ཆགས་པ་མེད་དོ། །ཐམས་ཅད་ལ་མི་རྟེན་པ་དང་། མི་གནས་པ་དང་། ལེན་པ་མེད་པ་དང་། འཕོས་པ་མེད་པ་ལ་གཉིས་སུ་མི་བྱེད་དོ། །
en: They are not attached to any kind of correct understanding, and they do not perceive dualistically that which is completely unsupported, nonabiding, not received, and not transferred.

source: ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་སུ་ཡང་དག་པར་གཞོལ་བར་ཤེས་པས་ཅུང་ཟད་ཀྱང་དབྱེ་བར་མི་བྱེད་དོ། །
en: Since they know that all phenomena are included within the realm of phenomena, they do not create any division whatsoever.

source: དེ་ཆགས་པའི་གཟུགས་ལ་སེམས་རྟོགས་པ་དང་། གཟུགས་དང་། ཚོར་བ་གཉིས་དང་བྲལ་བའོ། །
en: They understand that the forms to which one is attracted are the mind, and they are free from both forms and feelings.

source: གང་ཆགས་པའི་གཟུགས་ལ་ཚོར་བ་གང་ཆུའི་ཆུ་བུར་ལྟ་བུ་དང་། གང་འབྱུང་བ་ཟད་པ་འཇིག་པར་བརྟག་པ་འདི་དག་ནི་འདུ་བྱེད་བརྟག་པ་མེད་པའོ། །
en: “When one analyzes feelings related to attractive forms as being like water bubbles, and whatever arises as perishing and disintegrating, there is no analysis of formations.

source: ཁམས་གསུམ་ལས་འབྱུང་བ་འདི་ཡང་སྨོན་པ་མེད་པ་རྣམ་པར་ཐར་བའི་སྒོའོ། །
en: Whatever manifests in the three realms is without purpose and is the gateway to liberation.

source: གང་འདོད་ཆགས་དེ་ལ་བརྗོད་དུ་མེད་པའི་ཚོར་བ་དང་། དུས་གསུམ་གྱི་བསྒོམ་པ་ཐོབ་པ་འདི་ཡང་འདུ་བྱེད་སྡུག་བསྔལ་རབ་ཏུ་བྱེད་པའི་སྒོའོ། །
en: When one cultivates an inexpressible feeling toward attachment across the three times, it becomes a gateway to the creation of the suffering associated with formations.

source: ཁམས་གསུམ་གྱི་འདོད་ཆགས་ཀྱི་ཀུན་གཞི་ཚོར་བ་པོ་མེད་པ་དང་།
en: The fundamental ground of attachment related to the three realms is without someone who feels and has no afflictions.

source: ཉོན་མོངས་པ་མེད་པ་འདི་ཡང་མཚན་མ་མེད་པ་རྣམ་པར་ཐར་བའི་སྒོའོ། །
en: This lack of marks is the gateway to liberation.

source: གང་འདོད་ཆགས་ཀྱི་ཀུན་གཞི་ཚོར་བ་བླང་བ་མེད་ཅིང་དོར་བ་མེད་པ་དང་། ཚིག་གི་ལམ་བདག་མེད་པ་དང་། ཡི་གེར་དམིགས་པ་མེད་པ་དང་།
en: The feelings that are the fundamental ground of desire are without acceptance and rejection, without language, without a self, and lack apprehension of letters.

source: ཁམས་གསུམ་གྱི་ཚོར་བ་ཡུལ་མེད་ཅིང་མིག་ཡོར་མེད་པ་འདི་ཡང་འདུ་བྱེད་རྣམ་པར་ཞི་བའི་ཕྱིར་རོ། །བདག་མེད་པ་སྟོང་པ་ཉིད་རྣམ་པར་ཐར་པའི་སྒོའོ། །གང་ཁམས་གསུམ་ཐམས་ཅད་ལ་ཚོར་བ་དངོས་པོ་མེད་པ་དང་། སྣང་བ་མེད་པ་དང་།
en: When feelings related to the three realms have no object and there is no optical illusion, since formations are pacified, this lack of self and emptiness is the gateway to complete liberation.

source: ཡི་གེ་མེད་པ་དང་། བརྗོད་དུ་མེད་པ་དང་། ཟད་པ་མེད་པ་དང་། ཅི་ལའང་ཆགས་པ་མེད་པ་དེ། དེ་ལྟར་རབ་འབྲིང་དང་ཐ་མའི་ཉོན་མོངས་པ་རྒྱུན་ཆད་པར་འགྱུར་རོ། །
en: When feelings related to all three realms are insubstantial, unmanifested, wordless, inexpressible, and inexhaustible, there is no attachment to anything, so the severe, middling, and minor afflictions are cut off.

source: ནམ་མཁའ་ཇི་ལྟར་སྦྱོར་བ་མེད་པ་དེ་བཞིན་དུ་འདོད་ཆགས་ཀུན་ནས་ལྡང་བ་དང་། ཚོར་བ་སྦྱོར་བ་མེད་ཅིང་བརྗོད་དུ་མེད་པ་དང་། གཉིས་སུ་མེད་པ་དང་།
en: Just as space has no exertion, the arising of attachment and feelings also have no exertion, are inexpressible, and are nondual.

source: སེམས་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་ཁམས་གསུམ་གྱི་ཚོར་བ་ཅི་ལའང་ཆགས་པ་མེད་པ་དང་།
en: Bodhisattvas have no attachment to feelings related to the three realms in the mind or mental consciousness.

source: མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པ་དང་། འདོད་ཆགས་ཀྱི་ཀུན་གཞི་ཚོར་བ་མཚན་ཉིད་དམིགས་པ་མེད་པ་དང་།
en: They do not apprehend the characteristics of feelings, which are impermanent, suffering, empty, without a self, and the fundamental ground of attachment.

source: མཚན་ཉིད་དང་བྲལ་བའི་བཟོད་པ་སྒོམ་པར་བྱེད་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཉེ་བར་འཚོ་བའི་བཟོད་པར་བལྟ་བར་བྱའོ། །
en: This cultivation of acceptance of freedom from characteristics should be viewed as the bodhisattvas’ acceptance that looks after beings.

source: དེ་བཞིན་དུ་རྣ་བ་ལ་སྒྲ། སྣ་ལ་དྲི། ལྕེ་ལ་རོ། ལུས་ལ་རེག །ཡིད་ལ་ཆོས་ཏེ། གང་ཡིད་ཀྱིས་འདས་པ་དང་། མ་འོངས་པ་དང་།
en: “The same applies to the sounds in the ears, smells in the nose, tastes on the tongue, tactile sensations of the body, and mental phenomena in the mind.

source: ད་ལྟར་བྱུང་བའི་འདོད་ཆགས་ཀྱི་ཀུན་གཞི་ཀུན་ནས་ལྡང་བ་ཡིད་དུ་འོང་བའི་ཆོས་རྣམ་པར་ཤེས་ཤིང་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་མངོན་པར་དགའ་བ་རྗེས་སུ་དྲན་པ་དེ་ལ་ཡང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་འབྱུང་ངོ་། །
en: When the mind cognizes a fully arisen pleasant phenomenon that is the fundamental ground of attachment arising in the past, future, and present, and reflects upon that delightful form, sound, smell, taste, or tactile sensation, the mental consciousness has arisen.

source: ཚོར་བ་འདོད་ཆགས་ཀྱི་ཀུན་གཞིས་བསྐྱེད་དོ། །
en: Feeling is generated by the fundamental ground of attachment.

source: དེ་ལའང་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་དུ་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཚོར་བ་འདོད་ཆགས་ཀྱི་ཀུན་གཞི་ཚུལ་བཞིན་དུ་རྟོག་གོ། །
en: That is how bodhisattvas correctly analyze the mental consciousness and that feelings are the fundamental ground of attachment.

source: གཟུགས་ཀྱི་དངོས་པོ་རང་བཞིན་གྱིས་སྒྱུ་མ་ལྟ་བུའི་སེམས་དང་།
en: “The objective basis of form is the mind, which is illusory by nature.

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་འདི་སེམས་དང་། ཡིད་ཀྱི་སྒྲས་བརྗོད་དོ། །
en: The term mental consciousness refers to the mind, and it is expressed by the term mental faculty.

source: གང་འདས་པའི་སེམས་དེ་འགགས་པ་དང་། མ་འོངས་པའི་མ་བྱུང་བ་དང་། ད་ལྟར་བྱུང་བའི་སེམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་གནས་པའང་མེད་དོ། །སྐད་ཅིག་ཏུ་འཇིག་པ་དང་། མི་རྟག་པ་དང་། ལུས་མེད་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་དང་། ཡི་གེ་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་དང་།
en: The past mind has ceased, the future mind has not yet arisen, and the present mind and mental consciousness do not abide.

source: བྱ་བ་མེད་པ་དང་། འགྱུར་བ་མེད་པ་དང་། གཟུང་དུ་མེད་པ་དང་། གཏོང་བ་མེད་པ་དང་། མུན་པ་མེད་པ་དང་། སྣང་བ་མེད་པ་དང་། གཅིག་པུ་མ་ཡིན་པ་དང་། ཐ་མི་དད་པ་དང་། གཉིས་སུ་མེད་པ་དང་། གཉིས་ལྟ་བུ་མེད་པ་དང་། དངོས་པོ་མེད་པ་དང་། སྙེམས་པ་མེད་པ་དང་།
en: They immediately disintegrate and are impermanent, devoid of a body, without essence, wordless, without characteristics, without activity, unchanging, without accepting, without rejecting, without darkness, and without light.

source: སྤྲོས་པ་མེད་པ་དང་། ཕུལ་བ་མེད་པ་དང་། སེལ་བ་མེད་པ་དང་། ཀུན་གཞི་ཐམས་ཅད་དང་བྲལ་བ་དང་། ཆུ་ཟླ་ལྟ་བུ་དང་།
en: They lack sameness and difference, they are nondual, they are not like two things, and they are insubstantial, without conceit, without elaboration, without addition, without removal, free from all fundamental bases, and like the moon’s reflection in water.

source: འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ཆའི་གནས་མངོན་པར་དགའ་བའི་ཕྱི་རོལ་གྱི་དངོས་པོ་སེམས་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྐྱེན་ཇི་ལྟ་བ་བཞིན་དུ་སྣང་བར་འགྱུར་རོ། །
en: Anything remaining that arises in the past, future, or present, any pleasing external perceptual basis, the mind, and the mental consciousness all appear when the conditions are right.

source: ནམ་མཁའ་ཇི་ལྟར་ཉི་མ་དང་། ཟླ་བ་ལ་སྣང་བ་མེད་པའི་ནམ་མཁའ་དང་སྣང་བ་གཉིས་ཀྱི་མཚན་ཉིད་མེད་པ་དེ་མིང་ཙམ་གྱིས་བརྗོད་པ་དེ་བཞིན་དུ་སེམས་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་འདོད་ཆགས་ཀྱི་གནས་སྣང་བ་དང་། བརྗོད་དུ་མེད་པ་གཉིས་ཀྱི་མཚན་ཉིད་ཀྱང་མིང་ཙམ་གྱིས་བརྗོད་པ་ཡང་གཉིས་སུ་མེད་པ་དང་། གནས་པ་མེད་པ་དང་། གཟུགས་མེད་པ་དང་།
en: Just as the sky and the sun and moon lack the characteristics of both a sky that is not illuminated or illuminating and are mere verbal designations, so too the appearance of a basis of desire to the mind and mental consciousness is inexpressible and nondual, yet verbally designated as having the characteristic of being two things.

source: བསྟན་དུ་མེད་པ་དང་། ངོ་བོ་ཉིད་མེད་པ་དང་། ཡི་གེ་མེད་པ་དང་། སློང་བ་པོ་མེད་པ་ནས། སྟོན་པའི་བར་དུ་འདོད་ཆགས་ཀྱི་མཐའ་ལ་དེས་དེ་དག་སྟོང་ངོ་། །
en: They are everything from groundless, formless, undefinable, without essence, wordless, and without arousal up to not being displayed, and they are all empty from the perspective of desire.

source: དུས་གསུམ་གྱི་འདོད་ཆགས་ལ་ཀུན་གཞི་རྣམ་པར་སོགས་སོ། །
en: The desires of the three times possess a fundamental basis that is composite.

source: འདི་ལ་གནས་མེད་པས་ཅིའང་ཆགས་པ་མེད་པའི་བར་དུ་དེ་ལྟར་རབ་འབྲིང་དང་ཐ་མའི་ཉོན་མོངས་པ་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །
en: Thus, when bodhisattvas realize everything from their being baseless up to having absolutely no attachment, their severe, middling, and minor afflictions will be pacified.

source: ནམ་མཁའ་ཇི་ལྟར་མུན་པ་མེད་ཅིང་སྣང་བ་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་དེ་བཞིན་དུ་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་འདོད་ཆགས་ཀྱི་ཀུན་གཞི་ཡང་མུན་པ་མེད་ཅིང་སྣང་བ་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་ངོ་བོ་ཉིད་མེད་པ་དང་།
en: Just as the sky is without darkness, without light, and lacks characteristics, so, too, the mental consciousness that is the ground of desires also is without darkness, is without light, lacks characteristics, and has no essence.

source: སེམས་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཅི་ལའང་མ་ཆགས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཅི་ལའང་མ་ཆགས་པ་དང་།
en: Bodhisattvas are thus not attached in any way to the mind and the mental consciousness.

source: ཁམས་གསུམ་གྱི་འདོད་ཆགས་ཀྱི་ཀུན་གཞི་ཚོར་བ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་།
en: One should cultivate acceptance that the feelings that form the ground of the desires related to the three realms are impermanent, suffering, and empty, lack a self, and are free from characteristics.

source: བདག་མེད་པའི་མཚན་ཉིད་དང་བྲལ་བའི་བཟོད་པ་བསྒོམ་པར་བྱ་བ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་ཉེ་བར་འཚོ་བའི་བཟོད་པར་ཡོངས་སུ་བལྟ་བར་བྱའོ། །
en: This should be regarded as the bodhisattvas’ acceptance that ripens and looks after beings.

source: དེ་བཞིན་དུ་འདོད་ཆགས་ཀྱི་རྒྱུན་གཅོད་པར་ཡང་འགྱུར་རོ། །
en: That is how one ends the stream of desire.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔས་ཞེ་སྡང་སྐྱེ་བ་ཉོན་མོངས་པའི་རྩ་བ་ལས་ཟད་པར་ནུས་པའི་ཚུལ་བཞིན་དུ་བརྟག་པར་བྱའོ། །
en: “Furthermore, noble son, bodhisattvas should carry out a correct analysis that is able to eliminate the arising of anger at the root of the afflictions.

source: གང་མིག་གིས་གཟུགས་ཀྱི་མཚན་ཉིད་སྣང་བ་ཡིད་དུ་འོང་བ་དམའ་བ་ནས་ཉེ་བའི་བར་དུ་དེ་ལ་ཚོར་བ་ཆུའི་ཆུ་བུར་ལྟ་བུར་མི་སྡུག་པ་མངོན་པར་དགའ་བ་མེད་པར་འབྱུང་བའི་ཚོར་བ་སྟེ། དེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་དུ་རྟོག་གོ། །
en: Whether they are attractive or inferior, up to those that are near, feelings about the characteristics of forms that appear to the eye are like water bubbles. A bodhisattva correctly analyzes feelings that arise as neither unpleasant nor pleasant.

source: ཇི་ལྟར་མིག་མིག་གིས་སྟོང་པ་དང་། མིག་གཟུགས་རྣམ་པར་ཤེས་པས་སྟོང་པ་ནས་ཇི་ལྟར་གོང་དུ་བཤད་པའི་བར་དུའོ། །
en: The eye is empty of the eye, and the eye is empty of everything from the consciousness of forms up to all that was mentioned before.

source: སྐད་ཅིག་འཇིག་པ་ཟད་པའི་འདུ་བྱེད་དུས་གསུམ་གྱི་ཞེ་སྡང་གི་མཐའ་ལ་དེས་དེ་སྟོང་པ་ནས་སྣང་བ་མེད་པའི་བར་དུ་ཞེ་སྡང་གི་མཐའ་ལ་དེས་དེ་སྟོང་སྟེ་དུས་གསུམ་གྱི་ཞེ་སྡང་དམིགས་པ་རྣམ་པར་སོགས་སོ། །
en: Formations that instantly perish are everything from empty from the perspective of anger related to the three times up to being without light. They are empty from the perspective of anger, and the apprehension of the anger of the three times is composite.

source: ཞེ་སྡང་གནས་པ་མེད་པ་ནས་ཞེ་སྡང་ཅན་གྱི་གཟུགས་སྣང་བ་ལ་སེམས་གཞོག་པ་དང་། ཞེ་སྡང་གི་ཚོར་བ་དང་གཉིས་བྲལ་བར་འགྱུར་བའི་བར་དུའོ། །
en: Anger is everything from baseless up to being free from both the mind that settles on the appearance of a form that elicits anger and the feeling of anger.

source: གང་ཞེ་སྡང་ཅན་གྱི་གཟུགས་ལ་ཞེ་སྡང་གི་ཀུན་གཞི་འབྱུང་བ་དང་། ཚོར་བ་ཆུའི་ཆུ་བུར་ལྟ་བུར་འབྱུང་བ་ཟད་པ་འཇིག་པར་བརྟག་པ་འདི་དག་ཀྱང་འདུ་བྱེད་མི་རྟག་པ་ཞེས་བྱ་བའི་བར་དུ་བཟོད་པ་བལྟ་བར་བྱའོ། །
en: When the feelings and fundamental bases of anger that arise toward a form that elicits anger are analyzed as arising, perishing, and disintegrating, this should be viewed as the acceptance up to the point expressed in the phrase ‘formations are impermanent.’

source: དེ་བཞིན་དུ་རྣ་བས་སྒྲ་ནས་ཡིད་ཀྱིས་ཆོས་ཀྱི་བར་དུ་ཡིད་ཀྱིས་གང་མི་སྡུག་པ་དང་།
en: “The same applies to the sounds perceived by the ears up to the mental phenomena perceived by the mind.

source: མི་མཛེས་པའི་ཆོས་རྣམ་པར་ཤེས་པ་དེ་ལ་ཡང་ཞེ་སྡང་གི་ཀུན་གཞི་ཀུན་ནས་ལྡང་བའི་ཚོར་བ་ཀུན་ནས་འབྱུང་བར་འགྱུར་རོ། །
en: When the mind cognizes an unpleasant and unattractive phenomenon, the source is the fully arisen feeling that is the fundamental basis of anger.

source: དེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཞེ་སྡང་གི་ཀུན་གཞི་ཡིད་བཞིན་གྱི་ཚུལ་ཀུན་ཏུ་རྟོག་པར་བྱ་སྟེ།
en: Bodhisattvas should thoroughly analyze the way in which the fundamental basis of anger is like the mind.

source: འདི་དག་ནི་གཟུགས་མེད་པ་ལས་ཇི་ལྟ་བུར་གང་མ་བཤད་པའི་བར་དུའོ། །
en: These feelings are everything from without form up to what was explained before.

source: ནམ་མཁའ་ཇི་ལྟར་ཁྲོ་བ་མེད་ཅིང་གཤེ་བ་མེད་པ་ལྟར་ཞེ་སྡང་གི་ཀུན་གཞིའང་དེ་བཞིན་ནོ། །
en: The ground of anger is just like space—without aggression and abuse.

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཞི་བ་དེ་ལ་ཞེ་སྡང་མེད་ཅིང་གཤེ་བ་མེད་པ་དང་། ཅི་ལ་ཡང་ཆགས་པ་མེད་པ་དང་།
en: When the mental consciousness is pacified, there is no anger, there is no abuse, and there is no attachment whatsoever.

source: ཁམས་གསུམ་ཐམས་ཅད་ཀྱི་ཞེ་སྡང་གི་ཀུན་གཞི་ཚོར་བ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པ་དང་།
en: The feelings that are the fundamental basis of all anger related to the three realms are impermanent, suffering, empty, and lack a self.

source: མཚན་ཉིད་དང་བྲལ་བའི་བཟོད་པ་སྒོམ་པར་བྱེད་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པ་ཉེ་བར་འཚོ་བའི་བཟོད་པ་ཡོངས་སུ་སྨིན་པར་བྱའོ།། །།བམ་པོ་དྲུག་པ།
en: This cultivation of acceptance that is free from those characteristics should be brought to complete fruition as the bodhisattvas’ acceptance that ripens and looks after all beings.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་མིག་གིས་ནང་གིའམ་ཕྱིའི་གཟུགས་གང་ཇི་སྙེད་ཡོད་པ་དག་མཐོང་ནས། གང་ཡང་འདི་ལ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་གཟུགས་ཡང་དག་པ་མ་ཡིན་པར་ཀུན་ཏུ་རྟོག་པ་མུན་པར་གྱུར་པ། འདོད་ཆགས་ཀྱི་གནས། ཞེ་སྡང་གི་གནས་ལ་རྟག་པ་དང་།
en: “Furthermore, noble son, bodhisattvas see all outer and inner forms with their eyes and understand that whatever forms appear in the past, future, or present that are mistakenly imputed and shrouded in darkness are the basis of attachment and the basis of anger.
